:PROPERTIES:
:ID:       1a277cd5-c0bc-4ffd-8511-0ec2f7e0321b
:END:
#+TITLE: FRC: WPILib on NixOS with nix-ld
#+CATEGORY: slips
#+TAGS:

** Required to Link from WPILib Installation

For stability, you should have your linker find the dynamic libraries here;

#+begin_src shell :results output :dir (getenv "HOME")
tree --prune -P "*.so*" wpilib/2025/jdk/lib
#+end_src

#+RESULTS:
#+begin_example
wpilib/2025/jdk/lib
├── libattach.so
├── libawt_headless.so
├── libawt.so
├── libawt_xawt.so
├── libdt_socket.so
├── libextnet.so
├── libfontmanager.so
├── libinstrument.so
├── libj2gss.so
├── libj2pcsc.so
├── libj2pkcs11.so
├── libjaas.so
├── libjavajpeg.so
├── libjava.so
├── libjawt.so
├── libjdwp.so
├── libjimage.so
├── libjli.so
├── libjsig.so
├── libjsound.so
├── libjsvml.so
├── liblcms.so
├── libmanagement_agent.so
├── libmanagement_ext.so
├── libmanagement.so
├── libmlib_image.so
├── libnet.so
├── libnio.so
├── libprefs.so
├── librmi.so
├── libsaproc.so
├── libsctp.so
├── libsplashscreen.so
├── libsyslookup.so
├── libverify.so
├── libzip.so
└── server
    ├── libjsig.so
    └── libjvm.so

2 directories, 38 files
#+end_example

**** Comparing system =ldd= vs =fhsWithExtensions=

#+begin_quote
Note: this is early on
#+end_quote

+ system java: =/etc/profiles/per-user/dc/bin/java=
+ vscode java: =$HOME/wpilib/2025/jdk=

On the system:

#+begin_src shell
lib="$HOME/wpilib/2025/jdk/lib/libawt_xawt.so"
ldd $lib
#+end_src

Returns

#+name: lddAwtXAwtSys
#+begin_example
ldd: warning: you do not have execution permission for `/home/dc/wpilib/2025/jdk/lib/libawt_xawt.so'
linux-vdso.so.1 (0x00007fb9d76e1000)
libm.so.6 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libm.so.6 (0x00007fb9d758b000)
libawt.so => /home/dc/wpilib/2025/jdk/lib/libawt.so (0x00007fb9d749d000)
libXext.so.6 => not found
libX11.so.6 => not found
libXrender.so.1 => not found
libdl.so.2 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libdl.so.2 (0x00007fb9d7496000)
libXtst.so.6 => not found
libXi.so.6 => not found
libjava.so => /home/dc/wpilib/2025/jdk/lib/libjava.so (0x00007fb9d746c000)
libjvm.so => not found
libpthread.so.0 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libpthread.so.0 (0x00007fb9d7465000)
libc.so.6 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libc.so.6 (0x00007fb9d7200000)
/nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib64/ld-linux-x86-64.so.2 (0x00007fb9d76e3000)
libjvm.so => not found
libjvm.so => not found
#+end_example

From the VSCode shell (which /doesn't/ set =JAVA_HOME= yet)

#+begin_src shell
# javahome shouldn't matter here, but for clarity...
export JAVA_HOME="$HOME/wpilib/2025/jdk"
ldd $lib
#+end_src

Returns

#+name: lddAwtXAwtVscode
#+begin_example
ldd: warning: you do not have execution permission for `/home/me/wpilib/2025/jdk/lib/libawt_xawt.so'
linux-vdso.so.1 (0x00007f691e3c6000)
libm.so.6 => /lib/libm.so.6 (0x00007f691e26d000)
libawt.so => /home/dc/wpilib/2025/jdk/lib/libawt.so (0x00007f691e17f000)
libXext.so.6 => not found
libX11.so.6 => not found
libXrender.so.1 => not found
libdl.so.2 => /lib/libdl.so.2 (0x00007f691e178000)
libXtst.so.6 => not found
libXi.so.6 => not found
libjava.so => /home/dc/wpilib/2025/jdk/lib/libjava.so (0x00007f691e14e000)
libjvm.so => not found
libpthread.so.0 => /lib/libpthread.so.0 (0x00007f691e147000)
libc.so.6 => /lib/libc.so.6 (0x00007f691de00000)
/nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib64/ld-linux-x86-64.so.2 (0x00007f691e3c8000)
libjvm.so => not found
libjvm.so => not found
#+end_example

This only highlights the linking differences betwee =fhsWithExtensions= and the
objects not handled by =nix-ld=. Because of how =vscode= launches (as a wrapper to a
nix container, IIRC), some of the =FHS= paths above actually point to different
places!

#+name: diffOutputs
#+headers: :results output code :wrap example diff
#+begin_src shell  :var a=lddAwtXAwtSys b=lddAwtXAwtVscode
# system(a) -> fhsWithExtensions(b)
diff <(echo "$a" | sed -e 's/ (0x00.*$//g') \
    <(echo -e "$b" | sed -e 's/ (0x00.*$//g')
echo
#+end_src

#+RESULTS:
#+begin_example diff
1c1
< ldd: warning: you do not have execution permission for `/home/dc/wpilib/2025/jdk/lib/libawt_xawt.so'
---
> ldd: warning: you do not have execution permission for `/home/me/wpilib/2025/jdk/lib/libawt_xawt.so'
3c3
< libm.so.6 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libm.so.6
---
> libm.so.6 => /lib/libm.so.6
8c8
< libdl.so.2 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libdl.so.2
---
> libdl.so.2 => /lib/libdl.so.2
13,14c13,14
< libpthread.so.0 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libpthread.so.0
< libc.so.6 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libc.so.6
---
> libpthread.so.0 => /lib/libpthread.so.0
> libc.so.6 => /lib/libc.so.6

#+end_example

**** Comparison

From System

#+name: lddTargets
#+begin_src shell :results output :var d=(expand-file-name "~/wpilib/2025/jdk")
ldd $(find "$d" -name "*.so" -printf '%p ') 2>/dev/null \
    | grep -e '^	' \
    | sed -e 's/ (0x00.*$//g' \
    | tr -d '	' | sort | uniq
#+end_src

#+RESULTS: lddTargets
#+begin_example
libasound.so.2 => not found
libawt.so => /home/dc/wpilib/2025/jdk/lib/libawt.so
libawt_xawt.so => /home/dc/wpilib/2025/jdk/lib/libawt_xawt.so
libc.so.6 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libc.so.6
libdl.so.2 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libdl.so.2
libfreetype.so.6 => not found
libjava.so => /home/dc/wpilib/2025/jdk/lib/libjava.so
libjli.so => /home/dc/wpilib/2025/jdk/lib/libjli.so
libjvm.so => not found
libm.so.6 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libm.so.6
libnet.so => /home/dc/wpilib/2025/jdk/lib/libnet.so
libnio.so => /home/dc/wpilib/2025/jdk/lib/libnio.so
libpthread.so.0 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libpthread.so.0
librt.so.1 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/librt.so.1
libX11.so.6 => not found
libXext.so.6 => not found
libXi.so.6 => not found
libXrender.so.1 => not found
libXtst.so.6 => not found
linux-vdso.so.1
/nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib64/ld-linux-x86-64.so.2
#+end_example

#+name jdkLinksSystem
#+call: lddTargets(d="~/wpilib/2024/jdk")

#+RESULTS:
#+begin_example
libasound.so.2 => not found
libawt.so => /home/dc/wpilib/2025/jdk/lib/libawt.so
libawt_xawt.so => /home/dc/wpilib/2025/jdk/lib/libawt_xawt.so
libc.so.6 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libc.so.6
libdl.so.2 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libdl.so.2
libfreetype.so.6 => not found
libjava.so => /home/dc/wpilib/2025/jdk/lib/libjava.so
libjli.so => /home/dc/wpilib/2025/jdk/lib/libjli.so
libjvm.so => not found
libm.so.6 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libm.so.6
libnet.so => /home/dc/wpilib/2025/jdk/lib/libnet.so
libnio.so => /home/dc/wpilib/2025/jdk/lib/libnio.so
libpthread.so.0 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libpthread.so.0
librt.so.1 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/librt.so.1
libX11.so.6 => not found
libXext.so.6 => not found
libXi.so.6 => not found
libXrender.so.1 => not found
libXtst.so.6 => not found
linux-vdso.so.1
/nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib64/ld-linux-x86-64.so.2
#+end_example

And from VSCode

#+name: jdkLinksVscode
#+begin_example
libasound.so.2 => not found
libawt.so => /home/dc/wpilib/2025/jdk/lib/libawt.so
libawt_xawt.so => /home/dc/wpilib/2025/jdk/lib/libawt_xawt.so
libc.so.6 => /lib/libc.so.6
libdl.so.2 => /lib/libdl.so.2
libfreetype.so.6 => not found
libjava.so => /home/dc/wpilib/2025/jdk/lib/libjava.so
libjli.so => /home/dc/wpilib/2025/jdk/lib/libjli.so
libjvm.so => not found
libm.so.6 => /lib/libm.so.6
libnet.so => /home/dc/wpilib/2025/jdk/lib/libnet.so
libnio.so => /home/dc/wpilib/2025/jdk/lib/libnio.so
libpthread.so.0 => /lib/libpthread.so.0
librt.so.1 => /lib/librt.so.1
libX11.so.6 => /lib/libX11.so.6
libXau.so.6 => /nix/store/sckr00p0z6qzrkimvh8ing7yyg9zagri-libXau-1.0.12/lib/libXau.so.6
libxcb.so.1 => /nix/store/ck4f1lhzmbbrpharmzxnqzw4vfbgzkr7-libxcb-1.17.0/lib/libxcb.so.1
libXdmcp.so.6 => /nix/store/v5npwp9c426pcmvpm20vqljbbvp6m1g8-libXdmcp-1.1.5/lib/libXdmcp.so.6
libXext.so.6 => /nix/store/2lbv5rbgfwh2gn7n6pzb01p5y4vc683z-libXext-1.3.6/lib/libXext.so.6
libXext.so.6 => not found
libXi.so.6 => /lib/libXi.so.6
libXrender.so.1 => not found
libXtst.so.6 => not found
linux-vdso.so.1
/nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib64/ld-linux-x86-64.so.2
#+end_example


#+call: diffOutputs(a=jdkLinksSystem,b=jdkLinksVscode)

#+RESULTS:
#+begin_example diff
4,5c4,5
< libc.so.6 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libc.so.6
< libdl.so.2 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libdl.so.2
---
> libc.so.6 => /lib/libc.so.6
> libdl.so.2 => /lib/libdl.so.2
10c10
< libm.so.6 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libm.so.6
---
> libm.so.6 => /lib/libm.so.6
13,15c13,19
< libpthread.so.0 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libpthread.so.0
< librt.so.1 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/librt.so.1
< libX11.so.6 => not found
---
> libpthread.so.0 => /lib/libpthread.so.0
> librt.so.1 => /lib/librt.so.1
> libX11.so.6 => /lib/libX11.so.6
> libXau.so.6 => /nix/store/sckr00p0z6qzrkimvh8ing7yyg9zagri-libXau-1.0.12/lib/libXau.so.6
> libxcb.so.1 => /nix/store/ck4f1lhzmbbrpharmzxnqzw4vfbgzkr7-libxcb-1.17.0/lib/libxcb.so.1
> libXdmcp.so.6 => /nix/store/v5npwp9c426pcmvpm20vqljbbvp6m1g8-libXdmcp-1.1.5/lib/libXdmcp.so.6
> libXext.so.6 => /nix/store/2lbv5rbgfwh2gn7n6pzb01p5y4vc683z-libXext-1.3.6/lib/libXext.so.6
17c21
< libXi.so.6 => not found
---
> libXi.so.6 => /lib/libXi.so.6
#+end_example

* OpenDS

Requirements:

+ This needs to build against the WPILib JDK. Or rather, it must be built
  against the JDK it runs against.
  - After checking, =which java= in the VSCode environment falls through to
    =/etc/profiles/per-user/dc/bin/java=, though =JAVA_HOME= directs its JDK needs
    there.
  - =guix graph --type=package maven | dot -Tsvg > fdsa.svg= shows many =java=
    dependencies for =maven= ... but no jdk dependencies (I still can't figure out
    how to get =nix= to do this)
+ The build environment must also include a compatible maven, but I can just add
  that to my system and hopefully =JDK= sorts it out

#+begin_src sh
t=$(mktemp -d)
git clone https://github.com/Boomaa23/open-ds

nix-shell -p maven
export JAVA_HOME="$HOME/wpilib/2025/jdk"
make UNIX_JDK_INCLUDE_PATH=$JAVA_HOME/include clean
make UNIX_JDK_INCLUDE_PATH=$JAVA_HOME/include native-linux
make UNIX_JDK_INCLUDE_PATH=$JAVA_HOME/include build

# then copy the jar to the destination
#+end_src

The jar is missing some dependencies at runtime though, so... hmmm but =ldd=
doesn't report them... and also has the incorrect libc.

#+begin_src shell :results output verbatim
ldd /tmp/tmp.0plYPAcuL6/open-ds/target/classes/opends-lib-linux-amd64.so
#+end_src

#+RESULTS:
: 	linux-vdso.so.1 (0x00007f90c9bfa000)
: 	libc.so.6 => /nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib/libc.so.6 (0x00007f90c9800000)
: 	/nix/store/g8zyryr9cr6540xsyg4avqkwgxpnwj2a-glibc-2.40-66/lib64/ld-linux-x86-64.so.2 (0x00007f90c9bfc000)

... and i'm done

